# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
driver   = 'mysql+pymysql:'
user     = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
ip       = '34.65.10.136'
database = 'temp_states'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

pd.read_sql('SHOW TABLES;', engine)
# temp = pd.read_sql('SELECT * FROM temp_states', engine)
# temp_original = pd.read_sql('SELECT * FROM temp_states', engine)

OperationalError: (pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on '34.65.10.136' (timed out)")
(Background on this error at: http://sqlalche.me/e/e3q8)

#### Print `temp`.

In [3]:
# your code here
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here
There are two kinds of data: City and State, which are strings and Temperature, as a float.
"""

'\nyour comments here\nThere are two kinds of data: City and State, which are strings and Temperature, as a float.\n'

#### Select the rows where state is New York.

In [6]:
# your code here
ny_temp = temp[temp['State'] == 'New York']
ny_temp

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
# your code here
ny_temp.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here
temp[temp.Temperature > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here
temp[temp.Temperature > 15].City

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code here
temp[(temp.Temperature > 15) & (temp.Temperature < 20)].City

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
# your code here
temp.groupby(['State']).mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
# your code here
# your code here
driver   = 'mysql+pymysql:'
user     = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
ip       = '34.65.10.136'
database = 'employees'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

pd.read_sql('SHOW TABLES;', engine)
employees = pd.read_sql('SELECT * FROM employees', engine)
employees_original = pd.read_sql('SELECT * FROM employees', engine)

#### Explore the data types of the `employees` dataframe. Comment your results.

In [13]:
# your code here
employees.head(5)
# employees.dtypes
# employees.shape

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [14]:
"""
your comments here
Employees is a table of 9 rows and 7 columns where 2 of them are integers and the 7 other are strings
"""

'\nyour comments here\nEmployees is a table of 9 rows and 7 columns where 2 of them are integers and the 7 other are strings\n'

#### What's the average salary in this company?

In [15]:
# your code here
employees.Salary.mean()

48.888888888888886

#### What's the highest salary?

In [16]:
# your code here
employees.Salary.min()

30

#### What's the lowest salary?

In [17]:
# your code here
employees.Salary.max()

70

#### Who are the employees with the lowest salary?

In [18]:
# your code here
employees[employees.Salary == 30].Name

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [19]:
# your code here
employees[employees.Name == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [20]:
# your code here
employees[employees.Name == 'David'].Salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [21]:
# your code here
print(employees[employees.Title == 'associate'])

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [22]:
# Method 1
# your code here
print(employees.head(3))

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [23]:
# Method 2
# your code here
print(employees.loc[:2,:])

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [24]:
# your code here
employees[(employees.Title == 'associate') & (employees.Salary > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [25]:
# your code here
employees.groupby(['Years']).Salary.mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [26]:
# your code here
employees.groupby(['Title']).Salary.mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [27]:
# your code here
q1 = employees.Salary.quantile(0.25)
q3 = employees.Salary.quantile(0.75)
print(f'q1 = {q1}\nq3 = {q3}')

q1 = 35.0
q3 = 60.0

#### Is the mean salary different per gender?

In [28]:
# your code here
employees.groupby(['Gender']).Salary.mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [29]:
# your code here
employees.groupby(['Department']).describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [30]:
# your code here
# difference = employees.groupby(['Department']).Salary.max() - employees.groupby(['Department']).Salary.min()
difference = employees.groupby(['Department']).agg(lambda x: x['Salary'].max() - x['Salary'].min())['Salary']
difference

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [31]:
# your code here
driver   = 'mysql+pymysql:'
user     = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
ip       = '34.65.10.136'
database = 'orders'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

pd.read_sql('SHOW TABLES;', engine)
orders = pd.read_sql('SELECT * FROM orders', engine)
orders_original = pd.read_sql('SELECT * FROM orders', engine)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [32]:
# your code here
orders.shape
orders.dtypes
orders.columns
# orders.head(5)

Index(['index', 'InvoiceNo', 'StockCode', 'year', 'month', 'day', 'hour',
       'Description', 'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID',
       'Country', 'amount_spent'],
      dtype='object')

In [33]:
"""
your comments here
Orders is a very large file with almost 400k rows and 14 columns.
Only the StockCode, the Description, the InvoiceDate and the Country are strings.
"""

'\nyour comments here\nOrders is a very large file with almost 400k rows and 14 columns.\nOnly the StockCode, the Description, the InvoiceDate and the Country are strings.\n'

####  What is the average purchase price?

In [34]:
# your code here
orders.amount_spent.mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [35]:
# your code here
max_order = orders.amount_spent.max()
min_order = orders.amount_spent.min()
print(f'highest purchase: {max_order}\nlowest purchase: {min_order}')

highest purchase: 168469.6
lowest purchase: 0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [65]:
# your code here
spain_customers = orders[orders.Country == 'Spain'].groupby(['CustomerID']).CustomerID.count()

#### How many customers do we have in Spain?

In [66]:
# your code here
len(spain_customers)

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [71]:
# your code here
orders[orders.Quantity > 50].groupby(['CustomerID']).CustomerID.count()

CustomerID
12346     1
12347     1
12348    19
12355     2
12356     5
         ..
18246     2
18248     1
18251    16
18260     1
18287     1
Name: CustomerID, Length: 1301, dtype: int64

#### Select orders from Spain that include more than 50 items.

In [73]:
# your code here
spain50 = orders[(orders.Country == 'Spain') & (orders.Quantity > 50)]

#### Select all free orders.

In [75]:
# your code here
freeorders = orders[orders.amount_spent == 0]

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [82]:
# your code here
# pattern = '(lunch bag)%'

# s = pd.Series(['bat', 'Bear', 'cat', np.nan])
# s.str.startswith('b')
lunchbag = orders['Description'].str.startswith('lunch bag')
orders[lunchbag]

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,172,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,354,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,359,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,360,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,397465,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,397713,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,397714,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,397877,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,397880,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [84]:
# your code here
orders[lunchbag & (orders.year == 2011)].head(2)

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,26340,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.5
26341,26341,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.5

#### Show the frequency distribution of the amount spent in Spain.

In [89]:
# your code here
orders.amount_spent.value_counts(normalize = True, ascending=False).head(2)

15.0    0.050467
19.8    0.027726
Name: amount_spent, dtype: float64

#### Select all orders made in the month of August.

In [98]:
# your code here
august = orders[orders.month == 8]
august

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,199475,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,199476,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,199477,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,199478,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,199479,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,226483,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,226484,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,226485,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,226486,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,226487,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [103]:
# your code here
august.Country.value_counts()

United Kingdom     23105
Germany              795
EIRE                 593
France               569
Netherlands          280
Switzerland          267
Spain                252
Belgium              194
Israel               171
Channel Islands      140
Australia            107
Italy                 95
Austria               88
Norway                77
Finland               61
Malta                 55
Portugal              41
Sweden                40
Unspecified           23
Iceland               22
Poland                17
Denmark               16
Canada                 5
Name: Country, dtype: int64

#### What's the  average amount of money spent by country?

In [104]:
# your code here
orders.groupby(['Country']).amount_spent.mean()

Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615
Name: amount_spent, dtype: float64

#### What's the most expensive item?

In [108]:
# your code here
orders[orders.UnitPrice == orders.UnitPrice.max()].Description

118352    postage
Name: Description, dtype: object

#### What is the average amount spent per year?

In [110]:
# your code here
orders.groupby(['year']).amount_spent.mean()

year
2010    21.892733
2011    22.430074
Name: amount_spent, dtype: float64